app/views/students/_form.html.haml

SELECT "subject_items".* FROM "subject_items"  ORDER BY "subject_items"."title" ASC
---
  = f.input :birthdate, as: :date, start_year: Date.today.year - 20, end_year: Date.today.year - 5, order: [:day, :month, :year], prompt: true
  = f.association :subject_items, label_method: :title, value_method: :id, label: 'Subject Items', as: :check_boxes, collection: SubjectItem.order(:title)