app/views/students/show.html.haml

      %td= student.decorate.formatted_birthdate
    - if student.payments.any?
---
SELECT  1 AS one FROM "payments" WHERE "payments"."student_id" = $1 LIMIT 1  [["student_id", 9]]
SELECT "payments".* FROM "payments" WHERE "payments"."student_id" = $1  ORDER BY month_fee desc  [["student_id", 9]]