app/views/teachers/_form.html.haml

SELECT "subject_items".* FROM "subject_items" WHERE "subject_items"."teacher_id" = $1  [["teacher_id", 1]]
SELECT "subject_items".* FROM "subject_items"  ORDER BY "subject_items"."title" ASC
---
  = f.input :academic_title, collection: Teacher::TITLES, include_blank: false
  - if :subject_items.present?
    = f.association :subject_items, collection: SubjectItem.order(:title), label_method: :title, label: 'Subject Items', value_method: :id, as: :check_boxes