app/views/payments/_form.html.haml

	= f.input :month_fee, as: :date, start_year: Date.today.year - 1, end_year: Date.today.year, discard_day: true, order: [:month, :year]
	= f.association :student, label_method: lambda { |student| "#{student.first_name}" + " " + "#{student.last_name}" }, value_method: :id, collection: Student.order(:last_name)
---
SELECT "students".* FROM "students"  ORDER BY "students"."last_name" ASC