app/views/payments/index.html.haml

      %th= t('payment.columns.date')
      %th= t('payment.columns.sum')
---
SELECT "payments".* FROM "payments"