app/views/payments/show.html.haml

    %tr
      %td= "#{t('payment.columns.sum')}:"
---
SELECT "payments".* FROM "payments"