app/controllers/payments_controller.rb

  def create
  	if payment.save
---
INSERT INTO "payments" ("sum", "student_id", "date", "month_fee", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["sum", "100.0"], ["student_id", 1], ["date", "2015-08-08"], ["month_fee", "2015-08-01 00:00:00.000000"], ["created_at", "2015-12-04 12:10:02.689308"], ["updated_at", "2015-12-04 12:10:02.689308"]]

  def update
  	if payment.save
---
UPDATE "payments" SET "month_fee" = $1, "updated_at" = $2 WHERE "payments"."id" = $3  [["month_fee", "2015-11-01 00:00:00.000000"], ["updated_at", "2015-12-05 15:09:48.740430"], ["id", 1]]

  def destroy
  	payment.destroy
---
DELETE FROM "payments" WHERE "payments"."id" = $1  [["id", 1]]