app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "birthdate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Marcin"], ["last_name", "Borski"], ["birthdate", "2002-10-06"], ["created_at", "2015-11-30 13:05:53.309437"], ["updated_at", "2015-11-30 13:05:53.309437"]]
---
  def create
    if student.save

UPDATE "students" SET "first_name" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["first_name", "Marcinek"], ["updated_at", "2015-11-30 22:02:31.657579"], ["id", 1]]
---
  def update
    if student.save

DELETE FROM "students" WHERE "students"."id" = $1  [["id", 4]]
---
  def destroy
    student.destroy